const startText = `
哈囉～歡迎使用 Yo Tutor
我係 Telegram 補習配對機械人🤖
可以為你免費配對學生或導師
一般用戶每日最多可以聯絡 3 位學生
假如你想聯絡更多學生🧑‍🎓👩‍🎓
你便需要使用 Yo-points 🔋\n
每次聯絡學生會扣除 1 個 Yo-point
當你的 Yo-points 用完之後...\n
你可以在 menu 購買 Yo-points 🔋
或者訂閱月費計劃 ⭐️\n

想立即試用🤔 可以從以下選項開始：

登記成為導師，請按 /rt
登記成為學生，請按 /rs
搵導師，請按 /ft
搵學生，請按 /fs
想了解更多，請按 /help

👆🏼以上選項亦可以在左下角menu↙️找到\n`;

const helpText = `
Yo~ 我係 Yo Tutor
新世代補習配對服務

使用 Yo Tutor，你可以：

1️⃣ 免費配對學生或導師
2️⃣ 直接聯絡導師或學生
3️⃣ 讓學生或導師聯絡你

FAQ:

Q: Yo Tutor 係咪免費？

一般用戶可以免費使用 Yo Tutor
但每日最多只可以聯絡 3 位學生
假如你想聯絡更多學生/導師
你便需要使用 Yo-points 🔋

Q: 點解要有聯絡導師或學生嘅上限？

我哋希望用戶可以專注於少數導師或學生
而唔係一次過聯絡太多人，令配對更有效率
我哋亦唔想用戶收到太多嘅訊息

Q: 點解要用 Yo-points 🔋？

Yo-points 是為以下 2 種情況而設：

1️⃣ 學生/家長急於尋找導師去補習

2️⃣ 導師想招收更多學生去拓展業務

Q：除了 Yo-points 🔋，還有其他方法可以聯絡學生/導師嗎？

你可以訂閱月費計劃 ⭐️
當你訂閱計劃之後，你便可以無限制地聯絡學生/導師
同時我們會優先推薦你給學生/導師
`;

module.exports = {
  startText,
  helpText,
};
